/****************************************************************************/
/* 対象マイコン R8C/35A                                                     */
/* ﾌｧｲﾙ内容     データの入力、出力                                          */
/* バージョン   Ver.1.20                                                    */
/* Date         2010.04.19                                                  */
/* Copyright    ルネサスマイコンカーラリー事務局                            */
/*              日立インターメディックス株式会社                            */
/****************************************************************************/
/*
入力：P0_7-P0_0(ディップスイッチなど)
出力：P6_7-P6_0(LEDなど)

ポート0に入力した状態を、ポート6に出力します。
ポート0にセンサ基板、ポート6に実習基板のLED部分を接続すれば
センサ基板のチェックになります。
*/

/*======================================*/
/* インクルード                         */
/*======================================*/
#include "sfr_r835a.h"                  /* R8C/35A SFRの定義ファイル    */

/*======================================*/
/* シンボル定義                         */
/*======================================*/

/*======================================*/
/* プロトタイプ宣言                     */
/*======================================*/
void init( void );

/************************************************************************/
/* メインプログラム                                                     */
/************************************************************************/
void main( void )
{unsigned int i;
    unsigned int d;

    init();                             /* 初期化                       */

    while( 1 ) {
//          d = p0;  // => p0; 入力  p6 ; 出力
//         p6 = d;

		d = p6;  // => p6 ; 入力 p0 ; 出力
		p0 = d;

//        for (i=0 ; i<60000 ; i++);
//        p1_3 = ~p1_3;
//        d= p1 &0x0f ;
//        if (d == 0x0f ) p1=0x07; 
//       else  p1=( d | 0x10 )>>1;
     }
}

/************************************************************************/
/* R8C/35A スペシャルファンクションレジスタ(SFR)の初期化                */
/************************************************************************/
void init( void )
{
    int i;

    /* クロックをXINクロック(20MHz)に変更 */
    prc0  = 1;                          /* プロテクト解除               */
    cm13  = 1;                          /* P4_6,P4_7をXIN-XOUT端子にする*/
    cm05  = 0;                          /* XINクロック発振              */
    for(i=0; i<50; i++ );               /* 安定するまで少し待つ(約10ms) */
    ocd2  = 0;                          /* システムクロックをXINにする  */
    prc0  = 0;                          /* プロテクトON                 */

    /* ポートの入出力設定 */
    prc2 = 1;                           /* PD0のプロテクト解除          */
    pd0 = 0xff;                         /* スイッチなど入力             */
    p1  = 0x0f;                         /* 3-0:LEDは消灯                */
    pd1 = 0xdf;                         /* 5:RXD0 4:TXD0 3-0:LED        */
    pd2 = 0xfe;                         /* 0:PushSW                     */
    pd3 = 0xfb;                         /* 4:Buzzer 2:IR                */
    pd4 = 0x80;                         /* 7:XOUT 6:XIN 5-3:DIP SW 2:VREF*/
    pd5 = 0x40;                         /* 7:DIP SW                     */
    pd6 = 0x00;                         /* LEDなど出力                  */
}

/************************************************************************/
/* end of file                                                          */
/************************************************************************/
