/****************************************************************************/
/* 対象マイコン R8C/35A                                                     */
/* ﾌｧｲﾙ内容     タイマRCによるPWM出力                                       */
/* バージョン   Ver.1.20                                                    */
/* Date         2010.04.19                                                  */
/* Copyright    ルネサスマイコンカーラリー事務局                            */
/*              日立インターメディックス株式会社                            */
/****************************************************************************/
/*
入力：なし
出力：TRCIOC端子(P3_4)にブザーを接続

TRCIOC端子(P3_4)に接続したブザーから、音を鳴らします。
*/

/*======================================*/
/* インクルード                         */
/*======================================*/
#include "sfr_r835a.h"                  /* R8C/35A SFRの定義ファイル    */

/*======================================*/
/* シンボル定義                         */
/*======================================*/
/* 3オクターブ目の音階 */
#define         DO_3        38226       /* ド                           */
#define         DOU_3       36081       /* ド＃                         */
#define         RE_3        34056       /* レ                           */
#define         REU_3       32144       /* レ＃                         */
#define         MI_3        30340       /* ミ                           */
#define         FA_3        28637       /* ファ                         */
#define         FAU_3       27030       /* ファ＃                       */
#define         SO_3        25513       /* ソ                           */
#define         SOU_3       24081       /* ソ＃                         */
#define         RA_3        22729       /* ラ                           */
#define         RAU_3       21454       /* ラ＃                         */
#define         SI_3        20250       /* シ                           */

/* 4オクターブ目の音階 */
#define         DO_4        19113       /* ド                           */
#define         DOU_4       18040       /* ド＃                         */
#define         RE_4        17028       /* レ                           */
#define         REU_4       16072       /* レ＃                         */
#define         MI_4        15170       /* ミ                           */
#define         FA_4        14319       /* ファ                         */
#define         FAU_4       13515       /* ファ＃                       */
#define         SO_4        12756       /* ソ                           */
#define         SOU_4       12041       /* ソ＃                         */
#define         RA_4        11365       /* ラ                           */
#define         RAU_4       10727       /* ラ＃                         */
#define         SI_4        10125       /* シ                           */

/* 5オクターブ目の音階 */
#define         DO_5        9557        /* ド                           */
#define         DOU_5       9020        /* ド＃                         */
#define         RE_5        8514        /* レ                           */
#define         REU_5       8036        /* レ＃                         */
#define         MI_5        7585        /* ミ                           */
#define         FA_5        7159        /* ファ                         */
#define         FAU_5       6758        /* ファ＃                       */
#define         SO_5        6378        /* ソ                           */
#define         SOU_5       6020        /* ソ＃                         */
#define         RA_5        5682        /* ラ                           */
#define         RAU_5       5363        /* ラ＃                         */
#define         SI_5        5062        /* シ                           */

#define         TEMPO       60          /* テンポ                       */

/*======================================*/
/* プロトタイプ宣言                     */
/*======================================*/
void init( void );
void beep( unsigned int tone );

/*======================================*/
/* グローバル変数の宣言                 */
/*======================================*/
unsigned long   cnt_rb;                 /* タイマRB用                   */
int             music_dim;              /* 音楽データ配列の位置         */
int             music_flag;             /* 音楽データならすかどうか     */

const int music_data[][2] = {           /* 大きな古時計　音楽データ     */
/*
長さは、四分音符を4として、二分音符は8、八分音符は2となります。
休符も同様に、四分休符を4として、二部休符は8、八分休符は2となります。
*/
/*  音階,   長さ    */
    0,      0,  /* スタート*/

    RE_4,   4,  /* お */
    SO_4,   4,  /* お */
    FAU_4,  2,  /* き */
    SO_4,   2,  /* な */
    RA_4,   4,  /* のっ */
    SO_4,   2,  /* ぽ */
    RA_4,   2,  /* の */
    SI_4,   2,  /* ふ */
    SI_4,   2,  /* る */
    DO_5,   2,  /* ど */
    SI_4,   2,  /* け */
    MI_4,   4,  /* い */
    RA_4,   2,  /* お */
    RA_4,   2,  /* じ */
    SO_4,   4,  /* い */
    SO_4,   2,  /* さ */
    SO_4,   2,  /* ん */
    FAU_4,  4,  /* の */
    MI_4,   2,  /* と */
    FAU_4,  2,  /* け */
    SO_4,   10, /* い */
    0,      2,

    RE_4,   2,  /* ひゃ */
    RE_4,   2,  /* く */
    SO_4,   4,  /* ねん */
    FAU_4,  2,  /* い */
    SO_4,   2,  /* つ */
    RA_4,   4,  /* も */
    SO_4,   2,  /* う */
    RA_4,   2,  /* ご */
    SI_4,   4,  /* い */
    DO_5,   2,  /* て */
    SI_4,   2,  /* い */
    MI_4,   4,  /* た */
    RA_4,   2,  /* ご */
    RA_4,   2,  /* じ */
    SO_4,   4,  /* ま */
    SO_4,   2,  /* ん */
    SO_4,   2,  /* の */
    FAU_4,  4,  /* と */
    MI_4,   2,  /* け */
    FAU_4,  2,  /* い */
    SO_4,   10, /* さ */
    0,      2,

    SO_4,   2,  /* お */
    SI_4,   2,  /* じ */
    RE_5,   4,  /* い */
    SI_4,   2,  /* さ */
    RA_4,   2,  /* ん */
    SO_4,   4,  /* の */
    FAU_4,  2,  /* う */
    SO_4,   2,  /* ま */
    RA_4,   2,  /* れ */
    SO_4,   2,  /* た */
    FAU_4,  2,  /* あ */
    MI_4,   2,  /* さ */
    RE_4,   4,  /* に */
    SO_4,   2,  /* か */
    SI_4,   2,  /* っ */
    RE_5,   4,  /* て */
    SI_4,   2,  /* き */
    RA_4,   2,  /* た */
    SO_4,   4,  /* と */
    FAU_4,  2,  /* け */
    SO_4,   2,  /* い */
    RA_4,   10, /* さ */
    0,      2,

    RE_4,   2,  /* い */
    SO_4,   2,  /* ま */
    SO_4,   2,  /* は */
    0,      4,
    RA_4,   2,  /* もう */
    0,      2,
    0,      4,
    SI_4,   2,  /* う */
    SI_4,   2,  /* ご */
    DO_5,   2,  /* か */
    SI_4,   2,  /* な */
    MI_4,   4,  /* い */
    RA_4,   2,  /* そ */
    RA_4,   2,  /* の */
    SO_4,   8,  /* と */
    FAU_4,  8,  /* け */
    SO_4,   8,  /* い */
    0,      2,

    RE_4,   2,  /* ひゃ */
    RE_4,   2,  /* く */
    SO_4,   4,  /* ねん */
    RE_4,   2,  /* や */
    RE_4,   2,  /* す */
    MI_4,   2,  /* ま */
    RE_4,   2,  /* ず */
    RE_4,   4,  /* に */
    SI_3,   2,  /* ちっく */
    0,      2,
    RE_4,   2,  /* たっく */
    0,      2,
    SI_3,   2,  /* ちっく */
    0,      2,
    RE_4,   2,  /* たっく */
    RE_4,   2,  /* お */
    SO_4,   4,  /* じー */
    RE_4,   2,  /* さん */
    RE_4,   2,  /* と */
    MI_4,   4,  /* いっ */
    RE_4,   2,  /* しょ */
    RE_4,   2,  /* に */
    SI_3,   2,  /* ちっく */
    0,      2,
    RE_4,   2,  /* たっく */
    0,      2,
    SI_3,   2,  /* ちっく */
    0,      2,
    RE_4,   2,  /* たっく */

    RE_4,   2,  /* い */
    SO_4,   2,  /* ま */
    SO_4,   2,  /* は */
    0,      4,
    RA_4,   2,  /* もう */
    0,      2,
    0,      4,
    SI_4,   2,  /* う */
    SI_4,   2,  /* ご */
    DO_5,   2,  /* か */
    SI_4,   2,  /* な */
    MI_4,   4,  /* い */
    RA_4,   2,  /* そ */
    RA_4,   2,  /* の */
    SO_4,   8,  /* と */
    FAU_4,  8,  /* け */
    SO_4,   12, /* い */
    0,      4,

    -1,     0   /* 終了 */
};

/************************************************************************/
/* メインプログラム                                                     */
/************************************************************************/
void main( void )
{
    unsigned char d;

    init();                             /* 初期化                       */
    asm(" fset I ");                    /* 全体の割り込み許可           */

    music_flag = 1;                     /* 音楽スタート                 */

    while( 1 ) {
    }
}

/************************************************************************/
/* ブザーを鳴らす                                                       */
/* 引数　音階のPWM値                                                    */
/************************************************************************/
void beep( unsigned int tone )
{
    if( tone ) {
        trcmr  &= 0x7f;                 /* TRCのカウント停止            */
        trc     = tone - 1;
        trcgra  = tone - 1;             /* 周期設定                     */
        trcgrc  = tone / 2 - 1;         /* ON幅設定                     */
        trcmr  |= 0x80;                 /* TRCのカウント開始            */
    } else {
        trcmr  &= 0x7f;                 /* TRCのカウント停止            */
        trc     = 0;
        trcgra  = 0;                    /* 周期設定                     */
        trcgrc  = 0;                    /* ON幅設定                     */
        trcmr  |= 0x80;                 /* TRCのカウント開始            */
    }
}

/************************************************************************/
/* R8C/35A スペシャルファンクションレジスタ(SFR)の初期化                */
/************************************************************************/
void init( void )
{
    int i;

    /* クロックをXINクロック(20MHz)に変更 */
    prc0  = 1;                          /* プロテクト解除               */
    cm13  = 1;                          /* P4_6,P4_7をXIN-XOUT端子にする*/
    cm05  = 0;                          /* XINクロック発振              */
    for(i=0; i<50; i++ );               /* 安定するまで少し待つ(約10ms) */
    ocd2  = 0;                          /* システムクロックをXINにする  */
    prc0  = 0;                          /* プロテクトON                 */

    /* ポートの入出力設定 */
    prc2 = 1;                           /* PD0のプロテクト解除          */
    pd0 = 0xe0;                         /* 7-5:LED 4:MicroSW 3-0:Sensor */
    p1  = 0x0f;                         /* 3-0:LEDは消灯                */
    pd1 = 0xdf;                         /* 5:RXD0 4:TXD0 3-0:LED        */
    pd2 = 0xfe;                         /* 0:PushSW                     */
    pd3 = 0xfb;                         /* 4:Buzzer 2:IR                */
    pd4 = 0x83;                         /* 7:XOUT 6:XIN 5-3:DIP SW 2:VREF*/
    pd5 = 0x40;                         /* 7:DIP SW                     */
    pd6 = 0xff;

    /* タイマRBの設定 */
    /* 割り込み周期 = 1 / 20[MHz]    * (TRBPRE+1) * (TRBPR+1)
                    = 1 / (20*10^-6) * 200        * 100
                    = 0.001[s] = 1[ms]
    */
    trbpre = 200-1;                     /* プリスケーラレジスタ         */
    trbpr  = 100-1;                     /* プライマリレジスタ           */
    trbmr  = 0x00;                      /* 動作モード、分周比設定       */
    trbic  = 0x07;                      /* 割り込み優先レベル設定       */
    trbcr  = 0x01;                      /* カウント開始                 */

    /* タイマRC PWMモード設定 */
    trcmr   = 0x0a;                     /* TRCIOC端子はPWM出力          */
    trccr1  = 0xa0;                     /* カウントソース,初期出力の設定*/
    trccr2  = 0x00;                     /* 出力レベルの設定             */
    trcoer  = 0x0b;                     /* TROIOC出力許可               */
    trcpsr0 = 0x00;                     /* TRCIOA,B端子の設定           */
    trcpsr1 = 0x02;                     /* TRCIOC,D端子の設定           */
    trcgra  = 0;                        /* 周期設定                     */
    trcgrc  = 0;                        /* ON幅設定                     */
}

/************************************************************************/
/* タイマRB 割り込み処理                                                */
/************************************************************************/
#pragma interrupt intTRB(vect=24)
void intTRB( void )
{
    cnt_rb++;

    if( music_flag ) {
        /* ブザー処理 */
        if( cnt_rb >= 15000L * music_data[music_dim][1] / TEMPO ) {
            /* 次の音階をならす */
            cnt_rb = 0;
            music_dim++;
            if( music_data[music_dim][0] == -1 ) {
                /* -1なら終了 */
                beep( 0 );
                music_flag = 0;
            } else {
                /* -1でないなら次の音階セット */
                beep( music_data[music_dim][0] );
            }
        }
    }
}

/************************************************************************/
/* end of file                                                          */
/************************************************************************/
